// по умолчанию строгость выключена, при вклчени добавляется ряд проверок:

// 1. "alwaysStrict": true, // подразумевает что каждый файл ЖС будет в режиме "use strict"

// 2. "noImplicitAny": true, // нет явного эни, запрещает неявное использование , все обязано быть типизировано явноа

// 3. "strictNullChecks": true, // строгая проверка на null

// 4. "strictPropertyInitialization": true, // обязывает обознасать все свойства классов

// 5. "strictFunctionTypes": true, // строгая проверка сигрнатуры функции. не позволяет переназначить тип входным параметрам, даже по ссылке

// 6. "noImplicitThis": true, // нет явного this. запрещает не указывать this

// 7. "strictBindCallApply": true, // строгая проверка при использование функций Bind Call Apply
